test/stubs/invoices.json

{
  "object": "list",
  "data": [
    {"id":"in_99999","object":"invoice","amount_due":1000,"application_fee":null,"attempt_count":2,"attempted":true,"charge":"ch_d8D9s0","closed":false,"currency":"usd","customer":"cus_79ZU2mLycWhs6c","date":1463779914,"description":null,"discount":{"object":"discount","coupon":{"id":"show_discount_monthly","object":"coupon","amount_off":14000,"created":1457562199,"currency":"usd","duration":"forever","duration_in_months":null,"livemode":true,"max_redemptions":null,"metadata":{},"percent_off":null,"redeem_by":null,"times_redeemed":72,"valid":true},"customer":"cus_7ZTJl5J07hZwqW","end":null,"start":1461187797,"subscription":"sub_8J53aBWW8Xetrb"},"ending_balance":0,"forgiven":false,"lines":{"object":"list","data":[{"id":"sub_1234","object":"line_item","amount":15000,"currency":"usd","description":null,"discountable":true,"livemode":true,"metadata":{},"period":{"start":1463779797,"end":1466458197},"plan":{"id":"rewards_monthly","object":"plan","amount":15000,"created":1457546666,"currency":"usd","interval":"month","interval_count":1,"livemode":true,"metadata":{},"name":"Rewards Monthly","statement_descriptor":"WEDDING EXPO REWARDS","trial_period_days":null},"proration":false,"quantity":1,"subscription":null,"type":"subscription"}],"has_more":false,"total_count":1,"url":"/v1/invoices/in_2222/lines"},"livemode":true,"metadata":{},"next_payment_attempt":1464302217,"paid":false,"period_end":1463779797,"period_start":1461187797,"receipt_number":null,"starting_balance":0,"statement_descriptor":null,"subscription":"sub_83JcItwbPyAcvJ","subtotal":15000,"tax":null,"tax_percent":null,"total":1000,"webhooks_delivered_at":1463779914}
  ],
  "has_more": false,
  "url": "/v1/invoices"
}
