test/stubs/trial_subscription.json

{
  "id": "sub_83JcItwbPyAcvJ",
  "object": "subscription",
  "application_fee_percent": null,
  "cancel_at_period_end": false,
  "canceled_at": null,
  "current_period_end": 1619766000,
  "current_period_start": 1457551755,
  "customer": "cus_79ZU2mLycWhs6c",
  "discount": null,
  "ended_at": null,
  "metadata": {
  },
  "plan": {
    "id": "rewards_yearly",
    "object": "plan",
    "amount": 150000,
    "created": 1456443617,
    "currency": "usd",
    "interval": "year",
    "interval_count": 1,
    "livemode": false,
    "metadata": {
    },
    "name": "Rewards Yearly",
    "statement_descriptor": "WEDDING EXPO REWARDS",
    "trial_period_days": null
  },
  "quantity": 1,
  "start": 1457551755,
  "status": "trialing",
  "tax_percent": null,
  "trial_end": 1619766000,
  "trial_start": 1457551755
}
